
export const XP_GROUPS: Record<string, string[]> = {
    '角色': [
        '人妻', '熟女', '学生/JK', '少女', '御姐', '萝莉', '女上司', '秘书', '护士', '老师', '空姐', '女仆', '修女', '运动员', '邻居', '朋友', '近亲', '姐姐', '妈妈', '女儿', '孕妇', '偶像', '姐弟', '母子', '师生', '夫妻', '上司', '下属',
        '老板', '医生', '主人', '母亲', '宠物', '警察', '公主', '机器人', '奴隶', '服从者', '嫂子', '保姆', '姻亲', 'OL', '办公女郎', '女员工', '离异', '主播', '清洁工', '未婚妻', '新娘', '公公', '小叔子', '快递员', '导演', '前任', '姐妹', '闺蜜', '粉丝', '同事', '模特', '摄影师', '经纪人', '小姨子', '宅女', '毕业生', '辅导老师', '技师', '富家女', '女经理', '新人'
    ],
    '身体': [
        '巨乳', '贫乳', '美乳', '爆乳', '垂乳', '美腿', '足控', '巨臀', '美臀', '颜值', '身材', '肤白', '黑皮', '辣妹', '纹身', '穿环', '油亮', '多毛', '无毛', '美尻',
        '腹部', '金发', '体毛', '乳房', '臀部', '曲线', '耳朵', '眼睛', '脚', '雀斑', '头发', '手', '腿', '嘴唇', '肌肉', '肚脐', '鼻子', '孕肚', '阴毛', '疤痕', '皮肤', '苗条', '小乳', '高挑', '牙齿', '瘦弱', '脚趾', '皱纹', '阿姨', '眼镜', '土味', '中年', '修长', '长腿', '火辣', '风韵'
    ],
    '装扮': [
        '黑丝', '白丝', '网袜', '高跟', '制服', '西装', '眼镜', '口罩', '内衣', '情趣内衣', '丁字裤', '免脱', '胶衣', '皮革', '按摩棒', '假阴茎', '跳蛋', '项圈', '手铐',
        '比基尼', '眼罩', '靴子', '紧身胸衣', '服装', '鞭子', '裙子', '羽毛', '手套', '安全带', '帽子', '丝袜', '乳胶', '面具', '拍子', '肛塞', '警察服', '绳子', '校服', '泳装', '尾巴', '领带', '婚纱', '快递服', '舞台服', 'OL制服'
    ],
    '玩法': [
        '口交', '手交', '乳交', '足交', '肛交', '深喉', '69', '骑乘', '后入', '传教士', '侧入', '内射', '颜射', '口爆', '吞精', '中出', '多发', '潮吹', '失禁', 'SM', '调教', '捆绑', '窒息', 'SP', '打屁股', '3P', '群P', '轮奸',
        '咬', '蒙眼', '舔阴', '双插', '边缘控制', '电击', '脸坐', '指交', '拳交', '强制高潮', '群交', '冲击', '挑逗', '温度', '触手', '搔痒', '舔肛', '角色反转', '抓挠', '感官剥夺', '绳艺', '拍打', '女插男', '宠物扮演', '蜡烛', '鞭打', '直播', '下药', '媚药', '多人', '女王', '灌醉', '威胁', '诱惑', '游戏', '按摩', '足控'
    ],
    '剧情': [
        '纯爱', '温柔', '剧情', '调情', '接吻', 'NTR', '出轨', '寝取', '绿帽', '强迫', '勒索', '睡眠', '羞耻', '露出', '受辱', '堕落', '恶堕', '催眠', '时间停止', '强制', '凌辱', '乱伦', '禁忌', '家中', '户外', '车内', '办公室', '卧室', '校园', '酒店', '按摩店', '会议室', '同事家',
        '通奸', '洗脑', '支配', '幻想', '不忠', '嫉妒', '操纵', '痴迷', '赞美', '惩罚', '复仇', '斯德哥尔摩', '服从', '训练', '家庭', '照顾', '依赖', '离婚', '胁迫', '救助', '英雄救美', '偷窥', '职业', '暧昧', '订婚', '婚前', '报复', '欺骗', '小三', '补习', '寂寞', '修复', '上门', '一见钟情', '误会', '复合', '霸凌', '骚扰', '借宿', '吃醋', '多角关系', '沦陷', '单恋', '暗恋', '报复心理', '觉醒', '愤怒', '倦怠', '无聊', '重燃', '抗拒', '情意', '极致', '摄影棚', '后台'
    ],
    '风格': [
        '真人', '二次元', '动漫', '3D', '建模', 'Cosplay', 'AI生成', 'VR', '全景', 'MMD', 'PMV', '有声', 'ASMR', '漫画', '本子', '小说', '文爱', '硬核', '唯美', '艺术', '写实', 'POV', '淫乱', '痴女', '清纯', '害羞', '高冷', '顺从', '反抗', 'S属性', 'M属性',
        '2D', '渲染', '音频', '手绘', '同人', 'Hentai', '插图', '拍摄', '舞蹈', 'MV', '文字', '虚拟现实', '网络漫画', '混乱', '冷酷', '可爱', '优雅', '极端', '激烈', '轻松', '神秘', '调皮', '浪漫', '粗暴', '施虐', '感官', '柔软', '甜蜜', '禁忌', '挑逗', '欧美', '日韩', '国产', '韩国', '美国', '欧洲', '亚洲', '泰国', '俄罗斯', '巴西', '印度', '麻豆', '啄木鸟', 'Vixen', 'SOD', 'S1', 'Faleno', 'JAV', 'Brazzers', 'Black', 'Evil Angel', 'Tushy', 'Pure Taboo', 'X-Art', 'MetArt', 'FemJoy', '解说', 'AI视频', 'AI换脸', 'Deepfake'
    ]
};
